app/controllers/bookings_controller.rb

  def create

    @booking = Booking.new(booking_params)
    @booking.room = @room
    @booking.total_price = (@booking.ends_at - @booking.starts_at).to_i * @room.price_per_night
    @booking.user = current_user
    if @booking.save!
---
INSERT INTO "bookings" ("starts_at", "ends_at", "room_id", "user_id", "created_at", "updated_at", "total_price") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def dashboard
    @my_bookings = Booking.where(user: current_user)
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1  [["user_id", 13]]

  def destroy
    @booking.destroy
---
DELETE FROM "bookings" WHERE "bookings"."id" = $1  [["id", 30]]

  def set_flat
    @room = Room.find(params[:room_id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]

  def set_booking
    @booking = Booking.find(params[:id])
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]