app/controllers/pages_controller.rb

  def home
    @rooms = Room.all.sample(3)
---
SELECT "rooms".* FROM "rooms"