app/controllers/rooms_controller.rb

SELECT "hotels".* FROM "hotels" WHERE (name ILIKE '%paris%' OR address ILIKE '%paris%')
SELECT "rooms".* FROM "rooms" WHERE "rooms"."hotel_id" IN (SELECT "hotels"."id" FROM "hotels" WHERE (name ILIKE '%paris%' OR address ILIKE '%paris%')) ORDER BY "rooms"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
---
  def index
    if params[:query]
      @query = params[:query]
      sql_query = "name ILIKE :query OR address ILIKE :query"
      @hotels = Hotel.where(sql_query, query: "%#{params[:query]}%")
      @rooms = Room.where(hotel_id: @hotels)
    else
      @rooms = Room.all

SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 LIMIT $2  [["id", 105], ["LIMIT", 1]]
SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 AND (hotels.latitude IS NOT NULL AND hotels.longitude IS NOT NULL)  [["id", 105]]
---
  def show
    @hotel = Hotel.where(id: @room.hotel_id)
    @booking = Booking.new
    @markers = @hotel.geocoded.map do |room|

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 137], ["LIMIT", 1]]
---
  def set_room
    @room = Room.find(params[:id])